In [85]:
#handling missing value use pandas

In [86]:
import numpy as np
import pandas as pd

In [87]:
df= pd.DataFrame({"a":[2, 1, np.nan], "b":[np.nan, 4, np.nan], "c":[5, 4, 3], "d":[43, 2, 54]})

In [88]:
df

     a    b  c   d
0  2.0  NaN  5  43
1  1.0  4.0  4   2
2  NaN  NaN  3  54

In [89]:
df= df[df>0]
df

     a    b  c   d
0  2.0  NaN  5  43
1  1.0  4.0  4   2
2  NaN  NaN  3  54

In [90]:
#find which row there is no missin value
df.dropna()

     a    b  c  d
1  1.0  4.0  4  2

In [91]:
#same opration perform based on coloum
df.dropna(axis= 1)

   c   d
0  5  43
1  4   2
2  3  54

In [92]:
#thresh is means non null value its help to find out where is less null value
df.dropna(thresh= 3)

     a    b  c   d
0  2.0  NaN  5  43
1  1.0  4.0  4   2

In [93]:
df.fillna(value= "faka")

      a     b  c   d
0   2.0  faka  5  43
1   1.0   4.0  4   2
2  faka  faka  3  54

In [94]:
df["a"].fillna(value= df["a"].mean())

0    2.0
1    1.0
2    1.5
Name: a, dtype: float64

In [95]:
#Pandas Groupby some basic operation
data= {"company":["google", "google","twitter", "twitter","fb","fb"],
      "person": ["sam", "charli", "ram", "shaw","jodu", "modhu"],
      "sales": [120, 130, 110, 140, 100, 160]
      }
data

{'company': ['google', 'google', 'twitter', 'twitter', 'fb', 'fb'],
 'person': ['sam', 'charli', 'ram', 'shaw', 'jodu', 'modhu'],
 'sales': [120, 130, 110, 140, 100, 160]}

In [96]:
df= pd.DataFrame(data)
df

   company  person  sales
0   google     sam    120
1   google  charli    130
2  twitter     ram    110
3  twitter    shaw    140
4       fb    jodu    100
5       fb   modhu    160

In [97]:
bycom= df.groupby("company")
bycom

In [98]:
df.groupby("company").mean()

         sales
company
fb       130.0
google   125.0
twitter  125.0

In [99]:
df

   company  person  sales
0   google     sam    120
1   google  charli    130
2  twitter     ram    110
3  twitter    shaw    140
4       fb    jodu    100
5       fb   modhu    160

In [100]:
bycom.sum().loc["fb"]

sales    260
Name: fb, dtype: int64

In [101]:
df.groupby("company").count()

         person  sales
company
fb            2      2
google        2      2
twitter       2      2

In [102]:
df.groupby('company').min()

         person  sales
company
fb         jodu    100
google   charli    120
twitter     ram    110

In [103]:
df.groupby("company").describe()

        sales
        count   mean        std    min    25%    50%    75%    max
company
fb        2.0  130.0  42.426407  100.0  115.0  130.0  145.0  160.0
google    2.0  125.0   7.071068  120.0  122.5  125.0  127.5  130.0
twitter   2.0  125.0  21.213203  110.0  117.5  125.0  132.5  140.0

In [104]:
df.groupby("company").describe().transpose()

company              fb      google     twitter
sales count    2.000000    2.000000    2.000000
      mean   130.000000  125.000000  125.000000
      std     42.426407    7.071068   21.213203
      min    100.000000  120.000000  110.000000
      25%    115.000000  122.500000  117.500000
      50%    130.000000  125.000000  125.000000
      75%    145.000000  127.500000  132.500000
      max    160.000000  130.000000  140.000000

In [105]:
#concatination, marging and joing data using pandas

In [106]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [107]:
df1= pd.DataFrame(data_one)
df2= pd.DataFrame(data_two)

In [108]:
df1

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [109]:
df2

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [110]:
#concatinate row base, axis=0(default)
pd.concat([df1, df2])

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [111]:
#column basis here axis= 1
pd.concat([df1, df2], axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [112]:
#Axis 0 , but columns match up in this cas
df2.columns= df1.columns
pd.concat([df1, df2])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [113]:
df1.columns= df2.columns
pd.concat([df1, df2])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [114]:
#marge data table

In [115]:
reg = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
login = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [116]:
reg

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [117]:
login

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [118]:
#help(pd.merge)

In [119]:
#Left Join
#Match up AND include all rows from Left Table. 
#Show everyone who registered on Left Table, if they 
#don't have login info, then fill with NaN.

In [120]:
pd.merge(reg, login, how="left")

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [121]:
pd.merge(login, reg, how="left")

   log_id     name  reg_id
0       1   Xavier     NaN
1       2   Andrew     1.0
2       3  Yolanda     NaN
3       4     Bobo     2.0

In [122]:
#right Join
#Match up AND include all rows from right Table. 
#Show everyone who registered on right Table, if they 
#don't have reg info, then fill with NaN.

In [123]:
pd.merge(reg, login, how="right")

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

In [124]:
pd.merge(login, reg, how="left")

   log_id     name  reg_id
0       1   Xavier     NaN
1       2   Andrew     1.0
2       3  Yolanda     NaN
3       4     Bobo     2.0

In [125]:
#outer join
#show total marge table included nan value
pd.merge(login, reg, how="outer")

   log_id     name  reg_id
0     1.0   Xavier     NaN
1     2.0   Andrew     1.0
2     3.0  Yolanda     NaN
3     4.0     Bobo     2.0
4     NaN   Claire     3.0
5     NaN    David     4.0

In [126]:
reg= reg.set_index("name")
reg

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [127]:
#duita table er common rowgula marge hoye show korbe
pd.merge(reg,login,left_index=True, right_on='name')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [128]:
pd.merge(login, reg, right_index=True, left_on='name')

   log_id    name  reg_id
1       2  Andrew       1
3       4    Bobo       2

In [129]:
#joining two dataframe in pandas

In [130]:
left= pd.DataFrame({"A":["a1","a2", "a3"],
                      "B":["b1", "b2", "b3"]},
                  index=["k0", "k1", "k2"])
right= pd.DataFrame({"C":["c1","c2", "c3"],
                       "D":["d1", "d2", "d3"]},
                  index=["k0", "k4", "k2"])

In [131]:
#join dele prothom table er sobgula bosbe, second table er je index gula common seigular value bosbe, 
#jodi coloum gula uncommon thake tahole nan bosbe
left.join(right)

     A   B    C    D
k0  a1  b1   c1   d1
k1  a2  b2  NaN  NaN
k2  a3  b3   c3   d3

In [132]:
right.join(left)

     C   D    A    B
k0  c1  d1   a1   b1
k4  c2  d2  NaN  NaN
k2  c3  d3   a3   b3

In [133]:
#outer, when you want to show common uncommon both index
left.join(right, how="outer")

      A    B    C    D
k0   a1   b1   c1   d1
k1   a2   b2  NaN  NaN
k2   a3   b3   c3   d3
k4  NaN  NaN   c2   d2

In [134]:
#pandas operations

In [165]:
df= pd.DataFrame({"c1":[32, 24, 54, 24, 43],
                 "c2": [134, 234, 63, 24, 2],
                 "c3":["as", "ed", "d", "dsf", "q"]})

In [166]:
df

   c1   c2   c3
0  32  134   as
1  24  234   ed
2  54   63    d
3  24   24  dsf
4  43    2    q

In [167]:
#find unique value
df["c1"].unique()

array([32, 24, 54, 43], dtype=int64)

In [169]:
df["c1"].value_counts()

24    2
32    1
54    1
43    1
Name: c1, dtype: int64

In [139]:
df[df["c1"]>25]

   c1   c2  c3
0  32  134  as
2  54   63   d
4  43    2   q

In [140]:
def time(x):
    return x*2

In [141]:
df["c1"].apply(time)

0     64
1     48
2    108
3     48
4     86
Name: c1, dtype: int64

In [171]:
df.columns

Index(['c1', 'c2', 'c3'], dtype='object')

In [143]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [144]:
df.sort_values("c1")

   c1   c2   c3
1  24  234   ed
3  24   24  dsf
0  32  134   as
4  43    2    q
2  54   63    d

In [145]:
df.isnull()

      c1     c2     c3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

In [146]:
f= {"c1":["a","a","b", "b", "a", "a"],
    "c2": ["d", "d", "d", "c", "c", "d"],
    "c3": [3, 23, 12, 23, 3, 23],
    "c4": [32, 4, 34, 2, 34, 7]}

In [147]:
df= pd.DataFrame(f)
df

  c1 c2  c3  c4
0  a  d   3  32
1  a  d  23   4
2  b  d  12  34
3  b  c  23   2
4  a  c   3  34
5  a  d  23   7

In [148]:
df.pivot_table(values="c4", index= ["c1", "c2"], columns=["c3"])

c3       3     12   23
c1 c2
a  c   34.0   NaN  NaN
   d   32.0   NaN  5.5
b  c    NaN   NaN  2.0
   d    NaN  34.0  NaN

In [149]:
df.pivot_table( index= ["c1", "c2"], columns=["c3","c4"])

Empty DataFrame
Columns: []
Index: [(a, c), (a, d), (b, c), (b, d)]

In [150]:
# open and read csv, excel, HTML, SQL file using pandas

In [151]:
df=pd.read_csv("example.csv")
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [152]:
#if want to import file from diroctory
#df = pd.read_csv("C:\\Users\\myself\\files\\some_file.csv")

In [153]:
#Output
df.to_csv("My_output", index= False)

In [154]:
pd.read_csv("My_output")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [155]:
pd.read_excel("new_workbook.xlsx")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [156]:
pd.ExcelFile('new_workbook.xlsx').sheet_names

['First_Sheet']

In [157]:
excel_sheets = pd.read_excel('new_workbook.xlsx',sheet_name=None)

In [174]:
excel_sheets

{'First_Sheet':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15}

In [158]:
pd.ExcelFile('new_workbook.xlsx').sheet_names

['First_Sheet']

In [159]:
type(excel_sheets)

dict

In [160]:
excel_sheets.keys()

dict_keys(['First_Sheet'])

In [161]:
excel_sheets['First_Sheet']

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [162]:
#write to exca; file
df.to_excel('example.xlsx',sheet_name='First_Sheet',index=False)

In [163]:
#read html file using pandas

In [164]:
tables = pd.read_html('https://en.wikipedia.org/wiki/World_population')

URLError: <urlopen error [Errno 11001] getaddrinfo failed>

In [ ]:
len(tables)

In [ ]:
#not useful table
tables[0]

In [ ]:
tables[1]

In [ ]:
df.to_html('simple.html',index=False)

In [ ]:
#SQL Connections

In [ ]:
from sqlalchemy import create_engine

In [ ]:
temp_db = create_engine('sqlite:///:memory:')

In [ ]:
tables[0]

In [ ]:
pop = tables[0]

In [ ]:
pop.to_sql(name='pop',con=temp_db)

In [ ]:
#read from SQL Database
# Read in an entire table
pd.read_sql(sql='pop',con=temp_db)

In [ ]:
#read in with a SQL Query
#pd.read_sql_query(sql="SELECT index FROM pop", con= temp_db)